<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for OSXFUSE (filesystem in userspace driver)</string>
    <key>Identifier</key>
    <string>com.github.48kRAM.autopkg.download.osxfuse</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OSXFUSE</string>
	<key>OS_VERSION</key>
	<string>10.8</string>
	<key>INCLUDE_PRERELEASES</key>
	<string>true</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Please use the macFUSE recipes from https://github.com/autopkg/apizz-recipes instead. The osxfuse recipes are deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>include_prereleases</key>
                <string>%INCLUDE_PRERELEASES%</string>
                <key>github_repo</key>
                <string>osxfuse/osxfuse</string>
                <key>asset_regex</key>
                <string>^osxfuse-.*dmg$</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>   
			<key>Processor</key>   
    		<string>CodeSignatureVerifier</string>   
    		<key>Arguments</key>   
    		<dict>   
        		<key>input_path</key>   
        		<string>%pathname%/Extras/FUSE*.pkg</string>
        		<key>expected_authority_names</key>
        		<array>
            		<string>Developer ID Installer: Benjamin Fleischer (3T5GSNBU6W)</string>
            		<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
        		</array>
    		</dict>
		</dict>
    </array>
</dict>
</plist>
