<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Extract the flat package from the OSXFUSE dmg.</string>
    <key>Identifier</key>
    <string>com.github.48kRAM.autopkg.pkg.osxfuse</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OSXFUSE</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.48kRAM.autopkg.download.osxfuse</string>
    <key>Process</key>
    <array>
        <dict>
	    <key>Comment</key>
	    <string>Copy the pkg out of the DMG as it's flat and there's no need for the DMG</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Install OSXFUSE *.pkg</string>
		<key>pkg_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>
