<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for OSXFUSE (filesystem in userspace driver)</string>
    <key>Identifier</key>
    <string>com.github.48kRAM.autopkg.download.osxfuse</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OSXFUSE</string>
	<key>OS_VERSION</key>
	<string>10.8</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>os_version</key>
                <string>%OS_VERSION%</string>
            </dict>
            <key>Processor</key>
            <string>OSXFuseURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
