<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for yWorks yEd Graph Editor.</string>
    <key>Identifier</key>
    <string>com.github.48kRAM.autopkg.download.yed</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>yEd</string>
        <key>PACKAGE_ARCH</key>
        <string>amd64</string>
        <key>Comment</key>
        <string>PACKAGE_ARCH should be set to "arm64" (for Apple Silicon) or "amd64" (for Intel)</string>      
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\/resources\/yed\/demo\/yEd-[0-9\.]+_with-JRE[0-9][0-9]+\_%PACKAGE_ARCH%.dmg</string>
                <key>url</key>
                <string>https://www.yworks.com/downloads</string>
                <key>result_output_var_name</key>
                <string>url_path</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.yworks.com/%url_path%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/yEd.app</string>
                <key>requirement</key>
                <string>identifier "com.yworks.yEd" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JD89S887M2</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
