<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and install GNU Emacs for Mac OS X</string>
    <key>Identifier</key>
    <string>com.github.48kRAM.autopkg.install.emacsformacosx</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EmacsForMacOSX</string>
        <key>INSTALL_DESTINATION</key>
        <string>/Applications</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.48kRAM.autopkg.download.emacsformacosx</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>Emacs.app</string>
                        <key>destination_path</key>
                        <string>%INSTALL_DESTINATION%</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
