<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Sweet Home 3D by eTeks</string>
    <key>Identifier</key>
    <string>com.github.48kRAM.autopkg.download.sweethome3d</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SweetHome3D</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>product_name</key>
            <string>Installer</string>
        </dict>
            <key>Processor</key>
            <string>ETeksURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Sweet Home 3D.app</string>
                <key>requirements</key>
                <string>identifier "com.eteks.sweethome3d.SweetHome3D" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = U3J5N84335</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
